void main() {
  int x = 100;
  int y = 7;
  bool a = x == y;
  bool b = x != y;
  bool c = x < y;
  bool d = x > y;
  bool e = x <= y;
  bool f = x >= y;
  bool and = a & b;
  bool or = a | b;
  bool no = !b;
  bool xor = a ^ b;
  bool and1 = a && b;
  bool or1 = a || b;
  print("""-------------------------------------------------
Операції порівняння
-------------------------------------------------
 $x == $y = $a
 $x != $y = $b
 $x  < $y = $c
 $x  > $y = $d
 $x <= $y = $e
 $x >= $y = $f

-------------------------------------------------
Логічні операції 
-------------------------------------------------
Кон'юнкція (and)             $a & $b = $and
Диз'юнкція (or)              $a | $b = $or
Заперечення (no)             !$b = $no
Строга диз'юнкція (xor)      $a ^ $b = $xor
Короткозамикаюча кон'юнкція  $a && $b = $c
Короткозамикаюча диз'юнкція  $a || $b = $c""");
}
